#pragma once

//#pragma comment(lib, "../lib/jsonstthm.lib")

#include "Mod.hpp"
#include "EnemyData.hpp"
#include "ListEditor/MimicList.hpp"
#include <mutex>
#include <condition_variable>
#include "JsonStthm.h"
#include <filesystem>
#include <random>
#include <map>
#include <sstream>
#include "ImGuiExtensions/ImGuiExtensions.h"
#include "GameplayStateTracker.hpp"
#include "EndLvlHooks.hpp"
#include <algorithm>
#include "sdk/DMC5.hpp"

#define SELECTABLE_STYLE_ACT	ImVec4(0.26f, 0.39f, 0.58f, 0.41f)
#define SELECTABLE_STYLE_HVR	ImVec4(0.26f, 0.59f, 0.98f, 0.61f)
#define SELECTABLE_STYLE_ACT_HVR	ImVec4(0.26f, 0.59f, 0.98f, 0.91f) 

namespace json = JsonStthm;

namespace WaveEditorMod
{
	const ptrdiff_t COUNT_OFFS = 0x18;
	const ptrdiff_t ITEMS_OFFS = 0x10;
	const ptrdiff_t ARR_LENGTH_OFFS = 0x1C;
	const ptrdiff_t FIRST_ITEM_OFFS = 0x20;

	struct SetEmData
	{
		char mng[0x10];
		int emId;//0x10
		int idk = 0;// -
		uintptr_t strComment;//0x18
		int num = 1;//0x20
		float odds = 100.0f;//0x24
		bool isBoss = false;//0x28
		bool isNoDie = false;//0x29
		bool isNearPlayer = false;//0x2A
		bool isDontSetOrb = false;//0x2B
		float waitTimeMin = 0;//0x2C
		float waitTimeMax = 0;//0x30
		int greenOrbAddType;//0x34
		int whiteOrbAddType;//0x38
		int addParamIndex;//0x3C
		bool isAddParamSetPlayer = false;//0x40
		char idk2[0x7];
		uintptr_t AddParamIndexDataListPtr;//0x48
		bool isNetworkPlayerLimit;//0x50
		char idk3[0x2];
		int playerLimit;//0x54
		uintptr_t eventDataPtr;//0x58
		uintptr_t posDataListPtr;//0x60
		uintptr_t presetNoPtr;//0x68
		uintptr_t hpRatePtr;//0x70
		uintptr_t attackRatePtr;//0x78
		int selectedItem;//Non-class stuff

		void set_default()
		{
			emId = 0;
			num = 1;
			odds = 100.0f;
			isBoss = false;
			isNoDie = false;;
			isNearPlayer = false;
			isDontSetOrb = false;
			waitTimeMin = 0;
			waitTimeMax = 0;
			isAddParamSetPlayer = false;
		}
	};

	struct EmData
	{
		int emId;
		int num;

		bool operator ==(const EmData& other)
		{
			if (emId == other.emId && num == other.num)
				return true;
			else return false;
		}
		bool operator !=(const EmData& other)
		{
			return !(this->operator==(other));
		}
	};

	struct GameEmList
	{
		std::vector<EmData> emDataInfo;
		int loadId = 0;
		int count;
		uintptr_t listAddr = 0;

		bool operator ==(const GameEmList& other)
		{
			if (count != other.count)
				return false;
			else
			{
				for (int i = 0; i < count; i++)
				{
					if (emDataInfo[i] != other.emDataInfo[i])
						return false;
				}
				return true;
			}
		}
	};

	struct MimicListData
	{
		int loadId = 0;
